["Boom, the cherry bombs explode Blowing potholes in the road. Little bits of dynamite, Sure can give a guy a fright.  One went off by Irving's mamma. Poor thing damn near had a trauma. God, what simple-minded jerks, We turn loose with fireworks!","From North and South and East and West, The Coast Guard's in the fight. Destroying subs and landing troops, The Axis feels our might. For we're the first invaders, On every fighting field. Afloat, ashore, on men and Spars, You'll find the Coast Guard shield.  We're always ready for the call, We place our trust in Thee. Through howling gale and shot and shell, To win our victory. \"Semper Paratus\" is our guide, Our pledge, our motto, too. We're \"Always Ready,\" do or die! Aye! Coast Guard, we fight for you.  From Aztec shore to Arctic zone, To Europe and Far East. The Flag is carried by our ships, In times of war and peace. And never have we struck it yet, In spite of foe-men's might, Who cheered our crews and cheered again, For showing how to fight.  We're always ready for the call, We place our trust in Thee. Through howling gale and shot and shell, To win our victory. \"Semper Paratus\" is our guide, Our pledge, our motto, too. We're \" Always Ready,\" do or die! Aye! Coast Guard, we fight for you.  Surveyor and narcissus, The eagle and dispatch, The hudson and the tampa The names are hard to match; From Barrow's shores to Paraguay, Great Lakes or ocean's wave, The Coast Guard fought through storms and winds To punish or to save.  We're always ready for the call, We place our trust in Thee. Through howling gale and shot and shell, To win our victory. \"Semper Paratus\" is our guide, Our pledge, our motto, too. We're \"Always Ready,\" do or die! Aye! Coast Guard, we fight for you.  Aye, we've been \"Always Ready\" To do, to fight, or die Write glory to the shield we wear In letters to the sky. To sink the foe or save the maimed Our mission and our pride We'll carry on 'til Kingdom Come Ideals for which we've died.  We're always ready for the call, We place our trust in Thee. Through howling gale and shot and shell, To win our victory. \"Semper Paratus\" is our guide, Our pledge, our motto, too. We're \" Always Ready,\" do or die! Aye! Coast Guard, we fight for you.","O beautiful for spacious skies, For amber waves of grain, For purple mountain majesties Above the fruited plain! America! America! God she'd his grace on thee And crown thy good with brotherhood From sea to shining sea!  O beautiful for pilgrim feet Whose stern impassioned stress A thoroughfare of freedom beat Across the wilderness! America! America! God mend thine every flaw, Confirm thy soul in self-control, Thy liberty in law!  O beautiful for heroes proved In liberating strife. Who more than self their country loved And mercy more than life! America! America! May God thy gold refine Till all success be nobleness And every gain divine!  O beautiful for patriot dream That sees beyond the years Thine alabaster cities gleam Undimmed by human tears! America! America! God she'd his grace on thee And crown thy good with brotherhood From sea to shining sea!  O beautiful for halcyon skies, For amber waves of grain, For purple mountain majesties Above the enameled plain! America! America! God she'd his grace on thee Till souls wax fair as earth and air And music-hearted sea!  O beautiful for pilgrims feet, Whose stem impassioned stress A thoroughfare for freedom beat Across the wilderness! America! America! God she'd his grace on thee Till paths be wrought through Wilds of thought By pilgrim foot and knee!  O beautiful for glory-tale Of liberating strife When once and twice, For man's avail Men lavished precious life! America! America! God she'd his grace on thee Till selfish gain no longer stain The banner of the free!  O beautiful for patriot dream That sees beyond the years Thine alabaster cities gleam Undimmed by human tears! America! America! God she'd his grace on thee Till nobler men keep once again Thy whiter jubilee!","My country, 'tis of Thee, Sweet Land of Liberty Of thee I sing; Land where my fathers died, Land of the pilgrims' pride, From every mountain side Let Freedom ring.  My native country, thee, Land of the noble free, Thy name I love; I love thy rocks and rills, Thy woods and templed hills, My heart with rapture thrills Like that above.  Let music swell the breeze, And ring from all the trees Sweet Freedom's song; Let mortal tongues awake; Let all that breathe partake; Let rocks their silence break, The sound prolong.  Our fathers' God to Thee, Author of Liberty, To thee we sing, Long may our land be bright With Freedom's holy light, Protect us by thy might Great God, our King.  Our glorious Land to-day, 'Neath Education's sway, Soars upward still. It's hills of learning fair, Whose bounties all may share, Behold them everywhere On vale and hill!  Thy safeguard, Liberty, The school shall ever be, Our Nation's pride! No tyrant hand shall smite, While with encircling might All here are taught the Right With Truth allied.  Beneath Heaven's gracious will The stars of progress still Our course do sway; In unity sublime To broader heights we climb, Triumphant over Time, God speeds our way!  Grand birthright of our sires, Our altars and our fires Keep we still pure! Our starry flag unfurled, The hope of all the world, In peace and light impearled, God hold secure!","Stand, Navy, out to sea, Fight our battle cry; We'll never change our course, So vicious foe Steer shy-y-y-y. Roll out the tnt, Anchors Aweigh. Sail on to victory And sink their bones to Davy Jones, hooray!  Anchors Aweigh, my boys, Anchors Aweigh. Farewell to college joys, we sail at break of day-ay-ay-ay. Through our last night on shore, drink to the foam, Until we meet once more, Here's wishing you a happy voyage home.","Mine eyes have seen the glory of the coming of the Lord; He is trampling out the vintage where the grapes of Wrath are stored; He hath loosed the fateful lightning of His terrible Swift sword; His truth is marching on.  CHORUS Glory, glory! Hallelujah! Glory, glory! Hallelujah! Glory, glory! Hallelujah! His truth is marching on.  I have seen Him in the watchfires of a hundred circling Camps; They have building Him an altar in the evening dews and Damps; I can read His righteous sentence by the dim and flaring Lamps; His day is marching on.  CHORUS Glory, glory! Hallelujah! Glory, glory! Hallelujah! Glory, glory! Hallelujah! His day is marching on.  I have read a fiery gospel, writ in burnished rows of steel; \"As ye deal with my contemners, so with you my grace shall Deal; Let the hero, born of woman, crush the serpent with his heel, Since God is marching on.\"  CHORUS Glory, glory! Hallelujah! Glory, glory! Hallelujah! Glory, glory! Hallelujah! Since God is marching on.  He has sounded forth the trumpet that shall never call Retreat; He is sifting out the hearts of men before His judgement Seat; Oh, be swift, my soul, to answer Him! be jubliant, My feet! Our God is marching on.  CHORUS Glory, glory! Hallelujah! Glory, glory! Hallelujah! Glory, glory! Hallelujah! Since God is marching on.  In the beauty of the lilies, Christ was born across the Sea, With a glory in His bosom that transfigures you and me; As He died to make men holy, let us die to make men free, While God is marching on.  CHORUS Glory, glory! Hallelujah! Glory, glory! Hallelujah! Glory, glory! Hallelujah! While God is marching on.","Well, in eighteen and fourteen we took a little trip Along with Colonel Jackson down the mighty Mississip. We took a little bacon and we took a little beans, And we caught the bloody British near the town of New Orleans.  We fired our guns and the British kept a'comin. There wasn't nigh as many as there was a while ago. We fired once more and they began to runnin' Down the Mississippi to the Gulf of Mexico.  Well, I see'd Mars Jackson walkin down the street Talkin' to a pirate by the name of Jean Lafayette [pronounced La-feet] He gave Jean a drink that he brung from Tennessee And the pirate said he'd help us drive the British in the sea.  The French said Andrew, you'd better run, For Packingham's a comin' with a bullet in his gun. Old Hickory said he didn't give a dang, He's gonna whip the britches off of Colonel Packingham.  We fired our guns and the British kept a'comin. There wasn't nigh as many as there was a while ago. We fired once more and they began to runnin' Down the Mississippi to the Gulf of Mexico.  Well, we looked down the river and we see'd the British come, And there must have been a hundred of 'em beatin' on the drum. They stepped so high and they made their bugles ring While we stood by our cotton bales and didn't say a thing.  Old Hickory said we could take 'em by surprise If we didn't fire a musket til we looked 'em in the eyes. We held our fire til we see'd their faces well, Then we opened up with squirrel guns and really gave a yell.  We fired our guns and the British kept a'comin. There wasn't nigh as many as there was a while ago. We fired once more and they began to runnin' Down the Mississippi to the Gulf of Mexico.  Well, we fired our cannon til the barrel melted down, So we grabbed an alligator and we fought another round. We filled his head with cannon balls and powdered his behind, And when they tetched the powder off, the gator lost his mind.  We'll march back home but we'll never be content Till we make Old Hickory the people's President. And every time we think about the bacon and the beans, We'll think about the fun we had way down in New Orleans.  We fired our guns and the British kept a'comin, But there wasn't nigh as many as there was a while ago. We fired once more and they began to runnin' Down the Mississippi to the Gulf of Mexico.  Well, they ran through the briars and they ran through the brambles And they ran through the bushes where a rabbit couldn't go. They ran so fast the hounds couldn't catch 'em Down the Mississippi to the Gulf of Mexico.  We fired our guns and the British kept a'comin. But there wasn't nigh as many as there was a while ago. We fired once more and they began to runnin' Down the Mississippi to the Gulf of Mexico.","Oh, I wish I was in the land of cotton, Old times there are not forgotten, (Alt Original: Cinnamon seed and sandy bottom,) Look away, look away, look away Dixie Land.  In Dixie Land, where I was born in, Early on one frosty mornin', Look away, look away, look away Dixie Land.  I wish I was in Dixie, Hooray! Hooray! In Dixie Land I'll take my stand To live and die in Dixie. Away, away, away down south in Dixie. Away, away, away down south in Dixie  Ole Missus marry \"Will the weaver\" Willum was a gay deceiver Look away! Look away! Look away! Dixie Land  But when he put his arm around 'er, He smiled fierce as a forty pounder, Look away! Look away! Look away! Dixie Land  His face was sharp as a butcher's cleaver But that did not seem to grieve 'er Look away! Look away! Look away! Dixie Land  Ole Missus acted the foolish part And died for a man that broke her heart Look away! Look away! Look away! Dixie Land  Now here's a health to the next ole Missus An' all the gals that want to kiss us; Look away! Look away! Look away! Dixie Land  But if you want to drive 'way sorrow Come and hear this song tomorrow Look away! Look away! Look away! Dixie Land  There's buckwheat cakes and Injun batter, Makes you fat or a little fatter Look away! Look away! Look away! Dixie Land  Then hoe it down and scratch your gravel, To Dixie's Land I'm bound to travel, Look away! Look away! Look away! Dixie Land","Eternal Father, strong to save, Whose arm hath bound the restless wave, Who bidd'st the mighty ocean deep, It's own appointed limits keep.  Oh hear us when we cry to Thee, For those in peril on the sea! Amen.  Eternal Father, lend Thy grace To Those with wings who fly thro' space, Thro wind and storm, thro' sun and rain, Oh bring them safely home again.  Oh Father, hear an humble prayer, For those in peril in the air! Amen.  Oh Trinity of love and pow'are, Our brethren shield in danger's hour, From rock and tempest, fire and foe, Protect them where so e'er they go.  Thus evermore shall rise to Thee Glad hymns of praise from land and sea! Amen.","\"While the storm clouds gather far across the sea, Let us swear allegiance to a land that's free, Let us all be grateful for a land so fair, As we raise our voices in a solemn prayer. \"  God Bless America, Land that I love. Stand beside her, and guide her Thru the night with a light from above. From the mountains, to the prairies, To the oceans, white with foam God bless America, My home sweet home.","If tomorrow all the things were gone, I'd worked for all my life. And I had to start again, With just my children and my wife.  I'd thank my lucky stars, To be livin here today. 'Cause the flag still stands for freedom, And they can't take that away.  And I'm proud to be an American, Where at least I know I'm free. And I wont forget the men who died, Who gave that right to me.  And I gladly stand up, Next to you and defend her still today. 'Cause there ain't no doubt I love this land, God bless the usa.  From the lakes of Minnesota, To the hills of Tennessee. Across the plains of Texas, From sea to shining sea.  From Detroit down to Houston, And New York to L. A. Well there's pride in every American heart, And it's time we stand and say.  That I'm proud to be an American, Where at least I know I'm free. And I wont forget the men who died, Who gave that right to me.  And I gladly stand up, Next to you and defend her still today. 'Cause there ain't no doubt I love this land, God bless the usa.  And I'm proud to be and American, Where at least I know I'm free. And I wont forget the men who died, Who gave that right to me.  And I gladly stand up, Next to you and defend her still today. 'Cause there ain't no doubt I love this land, God bless the usa.","From the Halls of Montezuma To the shores of Tripoli We fight our country's battles In the air, on land, and sea; First to fight for right and freedom And to keep our honor clean; We are proud to claim the title Of United States Marine.  Our flag's unfurled to every breeze From dawn to setting sun; We have fought in every clime and place Where we could take a gun. In the snow of far-off Northern lands And in sunny tropic scenes; You will find us always on the job -- The United States Marines.  Here's health to you and to our Corps Which we are proud to serve; In many a strife we've fought for life And never lost our nerve. If the Army and the Navy Ever look on Heaven's scenes, They will find the streets are guarded By United States Marines.","I am thankful to be an American, To live in the greatest land of all. In a nation blessed, it's the very best, I can stand with my head up tall.  I am thankful to be an American, To be born in a land that's free. I am thankful to God for allowing me to be, An American.","I love my land America with blue skies big and wide; I love my land America with seas on either side The prairie corn grows tall and green, The wheat is amber gold: The rivers run from mountain peaks where the stars and stripes unfold. I love my land America, and as long as we are good, The Lord will bless America in love and brotherhood.","America, America, How can I tell you, How I feel? You have given me many treasures, I love you so.  America, America, Land of hope and liberty, Freedom rings from every mountain, From sea to sea","I'm a Yankee Doodle Dandy A Yankee Doodle, do or die A real live nephew of my Uncle Sam Born on the Fourth of July  I've got a Yankee Doodle sweetheart She's my Yankee Doodle joy Yankee Doodle came to London Just to ride the ponies I am the Yankee Doodle Boy","Let there be peace on Earth, And let it begin with me. Let there be peace on Earth, The peace that was meant to be.  With God as our Father, Brothers all are we, Let me walk with my brother, In perfect harmony.  Let peace begin with me, Let this be the moment now, With every step I take, Let this be my solemn vow,  To take each moment and live each moment In peace, eternally. Let there be peace on Earth, And let it begin with me.","Off we go into the wild blue yonder, Climbing high into the sun; Here they come zooming to meet our thunder, At 'em boys, Give 'er the gun! (Give 'er the gun now!) Down we dive, spouting our flame from under, Off with one heckuva roar! We live in fame or go down in flame. Hey! Nothing'll stop the you. S. Air Force!  Minds of men fashioned a crate of thunder Sent it high into the blue Hands of men blasted the world asunder, How they lived God only knew! Souls of men dreaming of skies to conquer Gave us wings ever to soar, With scouts before and bombers galore, Hey! Nothing'll stop the us Air Force!  Here's a toast to the host of those Who love the vastness of the sky, To a friend we send a message Of his brother men who fly. We drink to those who gave their all of old, Then down we roar To score the rainbow's pot of gold. A toast to the host of men we boast, the us Air Force.  Zoom!  Off we go into the wild sky yonder, Keep the wings level and true! If you'd live to be a grey-haired wonder, Keep your nose out of the blue! (Out of the blue, boy!) Flying men guarding the nation's border, We'll be there, followed by more, In echelon we carry on! Hey! Nothing'll stop the us Air Force!","Ring, O bells, from ev'ry steeple! Tell the story far and near; Let the breezes bear your echoes, Freedom's natal day is here. Fire the guns and shout for freedom, See the flag above unfurled! Hail the stars and stripes forever, Dearest flag in all the world.  Ring, O bells, and shout, O people, Float, O flag, from sea to sea! We, thy children, rally 'round thee, Hail, O flag of liberty!  Float, O starry flag of freedom! Flag our fathers died to save; He on whom your shadow lingers Never more can be a slave. May \"Old Glory\" float forever, High o'er vale and mountain crag, See her stars on ev'ry ocean, One dear country, one dear flag!  Ring, O bells, and shout, O people, Float, O flag, from sea to sea! We, thy children, rally 'round thee, Hail, O flag of liberty!","Let martial note in triumph float And liberty extend it's mighty hand A flag appears 'mid thunderous cheers, The banner of the Western land. The emblem of the brave and true It's folds protect no tyrant crew; The red and white and starry blue Is freedom's shield and hope. Other nations may deem their flags the best And cheer them with fervid elation But the flag of the North and South and West Is the flag of flags, the flag of Freedom's nation.  Hurrah for the flag of the free! May it wave as our standard forever, The gem of the land and the sea, The banner of the right. Let despots remember the day When our fathers with mighty endeavor Proclaimed as they marched to the fray That by their might and by their right It waves forever.  Let eagle shriek from lofty peak The never-ending watchword of our land; Let summer breeze waft through the trees The echo of the chorus grand. Sing out for liberty and light, Sing out for freedom and the right. Sing out for Union and it's might, O patriotic sons. Other nations may deem their flags the best And cheer them with fervid elation, But the flag of the North and South and West Is the flag of flags, the flag of Freedom's nation.  Hurrah for the flag of the free. May it wave as our standard forever The gem of the land and the sea, The banner of the right. Let despots remember the day When our fathers with might endeavor Proclaimed as they marched to the fray, That by their might and by their right It waves forever.","Day is done, gone the sun, From the lake, from the hills, from the sky; All is well, safely rest, God is nigh.  Fading light, dims the sight, And a star gems the sky, gleaming bright. From afar, drawing nigh, falls the night.  Thanks and praise, for our days, 'Neath the sun, 'neath the stars, neath the sky; As we go, this we know, God is nigh.  Sun has set, shadows come, Time has fled, Scouts must go to their beds Always true to the promise that they made.  While the light fades from sight, And the stars gleaming rays softly send, To thy hands we our souls, Lord, commend.","Intro: March along, sing our song, with the Army of the free Count the brave, count the true, who have fought to victory We're the Army and proud of our name We're the Army and proudly proclaim  First to fight for the right, And to build the Nation's might, And The Army Goes Rolling Along Proud of all we have done, Fighting till the battle's won, And the Army Goes Rolling Along.  Then it's Hi! Hi! Hey! The Army's on it's way. Count off the cadence loud and strong (Two! Three!) For where e'er we go, You will always know That The Army Goes Rolling Along.  Valley Forge, Custer's ranks, San Juan Hill and Patton's tanks, And the Army went rolling along Minute men, from the start, Always fighting from the heart, And the Army keeps rolling along.  Then it's Hi! Hi! Hey! The Army's on it's way. Count off the cadence loud and strong (Two! Three!) For where e'er we go, You will always know That The Army Goes Rolling Along.  Men in rags, men who froze, Still that Army met it's foes, And the Army went rolling along. Faith in God, then we're right, And we'll fight with all our might, As the Army keeps rolling along.  Then it's Hi! Hi! Hey! The Army's on it's way. Count off the cadence loud and strong (Two! Three!) For where e'er we go, You will always know That The Army Goes Rolling Along.","Fighting soldiers from the sky Fearless men who jump and die Men who mean just what they say The brave men of the Green Beret  Silver wings upon their chest These are men, America's best One hundred men will test today But only three win the Green Beret  Trained to live off nature's land Trained in combat, hand-to-hand Men who fight by night and day Courage peak from the Green Berets  Silver wings upon their chest These are men, America's best One hundred men will test today But only three win the Green Beret  Back at home a young wife waits Her Green Beret has met his fate He has died for those oppressed Leaving her his last request  Put silver wings on my son's chest Make him one of America's best He'll be a man they'll test one day Have him win the Green Beret.","Father and I went down to camp Along with Captain Gooden, And there we saw the men and boys As thick as hasty pudden  With fire ribbons in their hats, They looked tarnation fine O, I wish I had just such a one To give to my Jemimo.","Oh, say, can you see, by the dawn's early light, What so proudly we hail'd at the twilight's last gleaming? Whose broad stripes and bright stars, thro' the perilous fight, O'er the ramparts we watch'd, were so gallantly streaming? And the rockets' red glare, the bombs bursting in air, Gave proof thro' the night that our flag was still there. O say, does that star-spangled banner yet wave O'er the land of the free and the home of the brave?  On the shore dimly seen thro' the mists of the deep, Where the foe's haughty host in dread silence reposes, What is that which the breeze, o'er the towering steep, As it fitfully blows, half conceals, half discloses? Now it catches the gleam of the morning's first beam, In full glory reflected, now shines on the stream: 'Tis the star-spangled banner: O, long may it wave O'er the land of the free and the home of the brave!  And where is that band who so vauntingly swore That the havoc of war and the battle's confusion A home and a country should leave us no more? Their blood has wash'd out their foul footsteps' pollution. No refuge could save the hireling and slave From the terror of flight or the gloom of the grave: And the star-spangled banner in triumph doth wave O'er the land of the free and the home of the brave.  O, thus be it ever when freemen shall stand, Between their lov'd homes and the war's desolation; Blest with vict'ry and peace, may the heav'n-rescued land Praise the Pow'r that hath made and preserv'd us a nation! Then conquer we must, when our cause is just, And this be our motto: \"In God is our trust\" And the star-spangled banner in triumph shall wave O'er the land of the free and the home of the brave!","Chorus: This land is your land, this land is my land From California, to the New York Island From the redwood forest, to the gulf stream waters This land was made for you and me  As I was walking a ribbon of highway I saw above me an endless skyway I saw below me a golden valley This land was made for you and me  Chorus  I've roamed and rambled and I've followed my footsteps To the sparkling sands of her diamond deserts And all around me a voice was sounding This land was made for you and me  Chorus  The sun comes shining as I was strolling The wheat fields waving and the dust clouds rolling The fog was lifting a voice come chanting This land was made for you and me  Chorus  As I was walkin' - I saw a sign there And that sign said - no tress passin' But on the other side... It didn't say nothin! Now that side was made for you and me!  Chorus  In the squares of the city - In the shadow of the steeple Near the relief office - I see my people And some are grumblin' and some are wonderin' If this land's still made for you and me.  Chorus (2x)","We all heard the news today, so we took some time to pray for you Kids who've lost their moms and dads, Parents lost the children they had too, we pray for you Husbands who have lost their wives, And ladies lost the men in their lives too Workers who have lost their friends, Neighbors that we hope to see again too, we pray for you  Chorus  Twin towers we see you standing tall, Though a building's lost our faith will never fall Twin towers the world hears your call, Though you're gone it only strengthens our resolve We couldn't make it through this without you Lord, Through hard times we come together more  America the beautiful, we pray for our leaders too for you Washington and Adams cry, Freedom & our flag will fly for you We'll get through this troubled time, I'll care for yours, you care for mine too Let's lock arms and join our hands, young and old we'll take a stand for you  Chorus  Twin towers we see you standing tall, Though a building's lost our faith will never fall Pennsylvania and D.C. we hear your call, Through your pain it only strengthens our resolve We couldn't make it through this without you Lord, Through hard times we come together more  Repeat chorus  For freedom... for freedom...","When Johnny comes marching home again, Hurrah! Hurrah! We'll give him a hearty welcome then Hurrah! Hurrah! The men will cheer and the boys will shout The ladies they will all turn out And we'll all feel gay when Johnny comes marching home.  The old church bell will peal with joy Hurrah! Hurrah! To welcome home our darling boy, Hurrah! Hurrah! The village lads and lassies say With roses they will strew the way, And we'll all feel gay when Johnny comes marching home.  Get ready for the Jubilee, Hurrah! Hurrah! We'll give the hero three times three, Hurrah! Hurrah! The laurel wreath is ready now To place upon his loyal brow And we'll all feel gay when Johnny comes marching home.  Let love and friendship on that day, Hurrah, hurrah! Their choicest pleasures then display, Hurrah, hurrah! And let each one perform some part, To fill with joy the warrior's heart, And we'll all feel gay when Johnny comes marching home","Yankee Doodle went to town, a-riding on a pony; Stuck a feather in his cap and called it macaroni.  Chorus  Yankee Doodle keep it up, Yankee Doodle dandy, Mind the music and the step and with the girls be handy.  Father and I went down to camp along with Captain Gooding And there we saw the men and boys, as thick as hasty pudding.  There was Colonel Washington, upon a strapping stallion, A-giving orders to his men, I guess there was a million.  And there I saw a cannon barrel as big as mother's basin, And every time they touched it off they scampered like the nation.","You're a grand old flag, You're a high flying flag And forever in peace may you wave. You're the emblem of The land I love. The home of the free and the brave. Ev'ry heart beats true 'Neath the Red, White and Blue, Where there's never a boast or brag. Should auld acquaintance be forgot, Keep your eye on the grand old flag.  You're a grand old flag, You're a high flying flag And forever in peace may you wave. You're the emblem of The land I love. The home of the free and the brave. Ev'ry heart beats true 'Neath the Red, White and Blue, Where there's never a boast or brag. Should auld acquaintance be forgot, Keep your eye on the grand old flag."]